commit/app/models/account.rb

  def self.update_single_account_balances(account)
    received_money_transactions = ConfirmedTransaction.where(status: "cleared", destination: account)
    pre_cleared_transactions = OpenTransaction.where(status: "pre-cleared", destination: account)

    if received_money_transactions.count + pre_cleared_transactions.count == 0
      return nil
    else
      received_money = received_money_transactions.sum(:amount)
      pre_cleared_money = pre_cleared_transactions.sum(:amount)
    end

    highest_nonce = 0
    spent_money = 0

    ConfirmedTransaction.where(sender: account).each { |txn|
      spent_money += txn.amount if txn.status == "cleared"
      spent_money += txn.tx_fee if txn.status == "cleared"
      highest_nonce = txn.nonce if txn.nonce > highest_nonce
    }

    OpenTransaction.where(sender: account).each { |txn|
      spent_money += txn.amount if txn.status == "pre-cleared"
      spent_money += txn.tx_fee if txn.status == "pre-cleared"
      highest_nonce = txn.nonce if txn.nonce > highest_nonce
    }

    account_object = Account.find_or_create_by(account_id: account)
---
UPDATE "accounts" SET "confirmed_balance" = $1, "highest_nonce" = $2, "updated_at" = $3 WHERE "accounts"."id" = $4  [["confirmed_balance", 2000000000000.0], ["highest_nonce", 0], ["updated_at", "2021-10-15 21:31:15.618120"], ["id", 1]]
SELECT "confirmed_transactions"."destination" FROM "confirmed_transactions"
SELECT SUM("confirmed_transactions"."amount") FROM "confirmed_transactions" WHERE "confirmed_transactions"."status" = $1 AND "confirmed_transactions"."destination" = $2  [["status", "cleared"], ["destination", "0aKRMjy4GmRKZ2Ui4Zc8z9fqYOLTzwu9QD/JkGLd5Qw="]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_id" = $1 LIMIT $2  [["account_id", "0aKRMjy4GmRKZ2Ui4Zc8z9fqYOLTzwu9QD/JkGLd5Qw="], ["LIMIT", 1]]
SELECT "confirmed_transactions".* FROM "confirmed_transactions" WHERE "confirmed_transactions"."sender" = $1  [["sender", "0aKRMjy4GmRKZ2Ui4Zc8z9fqYOLTzwu9QD/JkGLd5Qw="]]
INSERT INTO "accounts" ("account_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["account_id", "0aKRMjy4GmRKZ2Ui4Zc8z9fqYOLTzwu9QD/JkGLd5Qw="], ["created_at", "2021-10-15 21:31:15.612425"], ["updated_at", "2021-10-15 21:31:15.612425"]]