commit/app/models/account.rb

  def self.update_all_account_balances
    accounts = ConfirmedTransaction.pluck(destination).uniq!
    accounts.each { |account|
      received_money = ConfirmedTransaction.where(status: "cleared", destination: account).sum(:amount)
      highest_nonce = 0
      sum = 0
      spent_money = ConfirmedTransaction.where(status: "cleared", sender: account).each { |txn|
---
SELECT "confirmed_transactions".* FROM "confirmed_transactions" WHERE "confirmed_transactions"."status" = $1 AND "confirmed_transactions"."sender" = $2  [["status", "cleared"], ["sender", "0aKRMjy4GmRKZ2Ui4Zc8z9fqYOLTzwu9QD/JkGLd5Qw="]]