clearing/app/models/account.rb

  def self.update_all_account_balances
    accounts = ConfirmedTransaction.pluck(destination).uniq!
    accounts.each { |account|
      received_money = ConfirmedTransaction.where(status: "cleared", destination: account).sum(:amount)
      highest_nonce = 0
      spent_money = 0
      ConfirmedTransaction.where(status: "cleared", sender: account).each { |txn|
        spent_money += txn.amount
        spent_money += txn.tx_fee
        highest_nonce = txn.nonce if txn.nonce > highest_nonce
      }
      account_object = Account.find_or_create_by(account_id: account)
      account_object.update(confirmed_balance: (received_money.to_f - spent_money.to_f), highest_nonce: highest_nonce)
---
SELECT "confirmed_transactions"."destination" FROM "confirmed_transactions"
SELECT SUM("confirmed_transactions"."amount") FROM "confirmed_transactions" WHERE "confirmed_transactions"."status" = $1 AND "confirmed_transactions"."destination" = $2  [["status", "cleared"], ["destination", "0aKRMjy4GmRKZ2Ui4Zc8z9fqYOLTzwu9QD/JkGLd5Qw="]]
SELECT "confirmed_transactions".* FROM "confirmed_transactions" WHERE "confirmed_transactions"."status" = $1 AND "confirmed_transactions"."sender" = $2  [["status", "cleared"], ["sender", "0aKRMjy4GmRKZ2Ui4Zc8z9fqYOLTzwu9QD/JkGLd5Qw="]]
INSERT INTO "accounts" ("account_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["account_id", "0aKRMjy4GmRKZ2Ui4Zc8z9fqYOLTzwu9QD/JkGLd5Qw="], ["created_at", "2021-10-15 21:31:11.276940"], ["updated_at", "2021-10-15 21:31:11.276940"]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_id" = $1 LIMIT $2  [["account_id", "0aKRMjy4GmRKZ2Ui4Zc8z9fqYOLTzwu9QD/JkGLd5Qw="], ["LIMIT", 1]]
UPDATE "accounts" SET "confirmed_balance" = $1, "highest_nonce" = $2, "updated_at" = $3 WHERE "accounts"."id" = $4  [["confirmed_balance", 2000000000000.0], ["highest_nonce", 0], ["updated_at", "2021-10-15 21:31:11.280559"], ["id", 1]]