clearing/app/models/block.rb

  def self.calculate_block_height
    Block.all.each { |block|
---
SELECT "blocks".* FROM "blocks"

  def self.find_height(block)
    prev_block = Block.find_by(block_hash: block.prev_block_hash)
    if prev_block.block_height
      block_height = prev_block.block_height + 1
      block.update(block_height: block_height)
      return block_height
    else
      block_height = Block.find_height(prev_block) + 1
      block.update(block_height: block_height)
---
SELECT "blocks".* FROM "blocks" WHERE "blocks"."block_hash" = $1 LIMIT $2  [["block_hash", "0000000000000000000000000000000000000000000000000000000000000ad0"], ["LIMIT", 1]]
UPDATE "blocks" SET "block_height" = $1, "updated_at" = $2 WHERE "blocks"."id" = $3  [["block_height", 1], ["updated_at", "2021-10-15 21:28:56.919572"], ["id", 2]]