commit/app/controllers/main_controller.rb

SELECT "blocks".* FROM "blocks" WHERE "blocks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "confirmed_transactions".* FROM "confirmed_transactions" WHERE "confirmed_transactions"."block_id" = $1  [["block_id", 4]]
---
  def current_highest_block #get current highest block
    block_id = Block.highest_block.id
    result = Block.includes(:confirmed_transactions).find(block_id).to_json(:include => :confirmed_transactions)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_id" = $1 LIMIT $2  [["account_id", "3"], ["LIMIT", 1]]
---
  def account
    account = Account.find_by(account_id: CGI.unescape(params[:id]))

SELECT "blocks".* FROM "blocks" WHERE "blocks"."block_height" BETWEEN $1 AND $2  [["block_height", 1], ["block_height", 51]]
SELECT "confirmed_transactions".* FROM "confirmed_transactions" WHERE "confirmed_transactions"."block_id" IN ($1, $2, $3)  [["block_id", 3], ["block_id", 2], ["block_id", 4]]
---
  def get_chain
    id_requested = params[:id] ? params[:id] : 0
    result = Block.includes(:confirmed_transactions).where(block_height: (id_requested.to_i)..((id_requested.to_i + 50))).to_json(:include => :confirmed_transactions)